from django.shortcuts import render, redirect
from django import forms

def home(request):
    content = {
        'tournaments': [
            ['Блиц', 'осталось 00:25', '1ч', '5'],
            ['Ежедневный турнир', 'осталось 03:30', '8ч', '32'],
            ['SitAndGo', 'завершено', '3ч', '14'],
            ['Блиц', 'завершено', '1ч', '8'],
            ['SitAndGo', 'завершено', '4ч', '12'],
            ['SitAndGo', 'завершено', '2ч', '16'],
            ['Блиц', 'завершено', '2ч', '10'],
        ],
        'waiting': [
            ['Давид',    '2406', 'Короткие'],
            ['Артур',    '2100', 'Длинные'],
            ['Арам',     '1950', 'Короткие'],
            ['Грант',    '2105', 'Длинные'],
            ['Арсен',    '1780', 'Короткие'],
            ['Нарек',    '2250', 'Длинные'],
            ['Ваге',     '1600', 'Короткие'],
            ['Геворг',   '2400', 'Длинные'],
            ['Серж',     '1823', 'Короткие'],
            ['Тигран',   '2022', 'Длинные'],
            ['Левон',    '2155', 'Короткие'],
            ['Ашот',     '1888', 'Длинные'],
            ['Самвел',   '1701', 'Короткие'],
            ['Армен',    '2303', 'Длинные'],
            ['Сурен',    '1999', 'Короткие'],
        ],
    }
    return render(request, 'main/home.html', content)
